УТ/src/InformationRegisters/CRM_ЛогиСобытийiCRM/CRM_ЛогиСобытийiCRM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ЛогиСобытийiCRM</name>
  <resources>
    <name>ОписаниеСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипСобытия</name>
    <type>
      <types>EnumRef.CRM_ТипыСобытийЛогаiCRM</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>УзелОбмена</name>
    <type>
      <types>ExchangePlanRef.CRM_СинхронизацияСМобильнымПриложениемНовый</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/InformationRegisters/CRM_ЛогиСобытийiCRM/Forms/ФормаЗаписиНезависимая/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторСобытия = Параметры.ИдентификаторСобытия;
	ТипСобытия = Параметры.ТипСобытия;
	ДатаСобытия = Параметры.ДатаСобытия;
	ОписаниеСобытия = Параметры.ОписаниеСобытия;
	
КонецПроцедуры

#КонецОбласти
